In [1]:
import pandas as pd
import sqlite3


conn = sqlite3.connect("database/db_olist.sqlite")
cursor = conn.cursor()

C:\Users\caiof\AppData\Local\Temp\ipykernel_11276\913944558.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Consultas em SQL - Tasks CEO

## Ciclo_1

###  Gere uma tabela com o id do cliente, a cidade e o estado onde ele vive:

In [2]:
cursor.execute(
  """
  SELECT
    c.customer_id,
    c.customer_city,
    c.customer_state
  FROM
    customer c
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "cidade", "estado"])

display(df)

                             id_cliente                 cidade estado
0      06b8999e2fba1a1fbc88172c00ba8bc7                 franca     SP
1      18955e83d337fd6b2def6b18a428ac77  sao bernardo do campo     SP
2      4e7b3e00288586ebd08712fdd0374a03              sao paulo     SP
3      b2b6027bc5c5109e529d4dc6358b12c3        mogi das cruzes     SP
4      4f2d8ab171c80ec8364f7c12e35b23ad               campinas     SP
...                                 ...                    ...    ...
99436  17ddf5dd5d51696bb3d7c6291687be6f              sao paulo     SP
99437  e7b71a9017aa05c9a7fd292d714858e8        taboao da serra     SP
99438  5e28dfe12db7fb50a4b2f691faecea5e              fortaleza     CE
99439  56b18e2166679b8a959d72dd06da27f9                 canoas     RS
99440  274fa6071e5e17fe303b9748641082c8                  cotia     SP

[99441 rows x 3 columns]

### Gere uma tabela com o id do cliente e a cidade, somente dos clientes que vivem em Santa Catarina:

In [3]:
cursor.execute(
    """
SELECT
  c.customer_id,
  c.customer_city
FROM
  customer c
WHERE
  c.customer_state = 'SC'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "cidade"])

display(df)

                            id_cliente          cidade
0     879864dab9bc3047522c92c82e1212b8  jaragua do sul
1     154c4ded6991bdfa3cd249d11abf4130   florianopolis
2     b6368ca0f56d4632f44d58ca431487b2        sao jose
3     4d27341acd30a36bca39008ee9bb9050  jaragua do sul
4     443b534d0d27a8aa9a184d4869bcbe7a  jaragua do sul
...                                ...             ...
3632  f1def85ade6e5b754d5f84a958fd48c2   florianopolis
3633  36cf561d6c23f010a6944f0908ee6bdc         cacador
3634  61999ea0577a957d34dfa9728c1ba783           seara
3635  69f774928b3541289743181082f07ea7         sombrio
3636  ec126b0b2593214b75ec14893b15d9e5           mafra

[3637 rows x 2 columns]

### Gere uma tabela com o id do cliente e o estado, somente dos clientes que vivem em Florianópolis:

In [4]:
cursor.execute(
    """
SELECT
  c.customer_id,
  c.customer_state
FROM
  customer c
WHERE
  c.customer_city = 'florianopolis'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_cliente", "estado"])

display(df)

                           id_cliente estado
0    154c4ded6991bdfa3cd249d11abf4130     SC
1    2173c184771a8a19f6fc87d8b3dea9e0     SC
2    02f615f19af07c54a0d4653308f6674b     SC
3    151260cb5d9b3c220d0af50c81c329a9     SC
4    d494b02fb3835e2d398d44ea7f275bce     SC
..                                ...    ...
565  be2b84f5d9486064e0163c4c966b30d8     SC
566  0f8578d7df4151708dbebbd72050ce3c     SC
567  16f656f511e27cc3fbf91cbc28c415d3     SC
568  3e16ea28d6bd7480ea19cd0d7c248f51     SC
569  f1def85ade6e5b754d5f84a958fd48c2     SC

[570 rows x 2 columns]

### Gere uma tabela com o estado, latitude e longitude do estado de São Paulo:

In [5]:
cursor.execute(
    """
SELECT
  g.geolocation_lat,
  g.geolocation_lng,
  g.geolocation_state
FROM
  geolocation g
WHERE
  g.geolocation_state = 'SP'
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["latitude", "longitude", "estado"])

display(df)

         latitude  longitude estado
0      -23.545621 -46.639292     SP
1      -23.546081 -46.644820     SP
2      -23.546129 -46.642951     SP
3      -23.544392 -46.639499     SP
4      -23.541578 -46.641607     SP
...           ...        ...    ...
404263 -22.779062 -50.218287     SP
404264 -22.997601 -49.885928     SP
404265 -22.978498 -49.875919     SP
404266 -22.993127 -49.887665     SP
404267 -22.972685 -49.864647     SP

[404268 rows x 3 columns]

### Gere uma tabela com o id do produto, a data de envio e o preço, somente para produtos acima de 6300

In [6]:
cursor.execute(
    """
SELECT
  oi.order_id,
  oi.shipping_limit_date,
  oi.price
FROM
  order_items oi
WHERE
  oi.price > 6300
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "dt_envio", "preço"])

display(df)

                          id_pedido             dt_envio   preço
0  0812eb902a67711a1cb742b3cdaa65ae  2017-02-16 20:37:36  6735.0
1  f5136e38d1a14a4dbd87dff67da82701  2017-06-15 02:45:17  6499.0
2  fefacc66af859508bf1a7934eab1e97f  2018-08-02 04:05:13  6729.0

###  Gere uma tabela com o id do pedido, o tipo de pagamento e o número de parcelas, somente para produtos com parcelas menores que 1

In [7]:
cursor.execute(
    """
SELECT
  op.order_id,
  op.payment_type,
  op.payment_installments
FROM
  order_payments op
WHERE
  op.payment_installments < 1
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "tipo_pagamento", "parcelas"])

display(df)

                          id_pedido tipo_pagamento  parcelas
0  744bade1fcf9ff3f31d860ace076d422    credit_card         0
1  1a57108394169c0b47d8f876acc9ba2d    credit_card         0

### Gere uma tabela com o id do pedido, id do cliente, o status do pedido e a data de aprovação , somente para compras aprovadas até dia 20 de Maio de 2016

In [8]:
cursor.execute(
    """
SELECT
  o.order_id,
  o.customer_id,
  o.order_status,
  o.order_approved_at
FROM
  orders o
WHERE
  o.order_approved_at < "2016-20-05"
"""
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["id_pedido", "id_cliente", "status_pedido", "pedido_aprovado_dt"])

display(df)

,id_pedido,id_cliente,status_pedido,pedido_aprovado_dt
0,d3c8851a6651eeff2f73b0e011ac45d0,957f8e082185574de25992dc659ebbc0,processing,2016-10-06 15:51:05
1,cbbb524a0e1646aa6cf7a3c0bbe517ad,dacb079d55ffb1d3955c5d923df3ebb7,delivered,2016-10-06 02:46:24
2,ac2b7c522d811acba0aa270ed3e112e4,ef21aebbb093a6db29ccc6aa0b89c347,delivered,2016-10-06 15:44:26
3,7033745709b7cf1bac7d2533663592de,7f0ca17bb33b230b47459437cf0682c7,delivered,2016-10-04 14:46:48
4,5cd498954e2b37d71b315166809b4bd7,ff1a56726b7ea149c7423865609cc0c8,delivered,2016-10-08 03:56:15
...,...,...,...,...
317,6e0d2539e48e84296bae6290de41058c,1fc56719b52f82c03caddc5faf531fbb,delivered,2016-10-06 15:51:37
318,9d664ec86be69d869bb6870294c4fdd8,0a9ee4d9030acbe428769c79d0c4da69,delivered,2016-10-08 19:55:50
319,7e2dddf174cc4d2768bf39c43ab2bd7a,accfbaa1f092fdf6db1d8fcdad351b50,delivered,2016-10-10 05:54:51
320,e439ced3d48f1a77f6ecc029cc946a6f,e9c6723e04c4e53e7e9c3afe383f3866,delivered,2016-10-07 22:59:53
321,509a52223ecac6d67fb765b3b37c6974,efc07f50d0a9346ec00e1c37b5b10748,delivered,2016-10-06 18:50:35

## Ciclo_02

### Qual o número de clientes únicos do estado de Minas Gerais?

In [9]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT customer_id) AS qt_clientes_unicos
  FROM
    customer c
  WHERE
    customer_state = 'MG'
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de clientes únicos em MG é: {value}')

A quantidade de clientes únicos em MG é: 11635

### Qual a quantidade de cidades únicas dos vendedores do estado de Santa Catarina?

In [10]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT s.seller_city)
  FROM
    sellers s
  WHERE
    s.seller_state = "SC"
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de cidades únicas dos vendedores em SC é: {value}')

A quantidade de cidades únicas dos vendedores em SC é: 65

### Qual a quantidade de cidades únicas de todos os vendedores da base?

In [11]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT s.seller_city)
  FROM
    sellers s
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'A quantidade de cidades únicas dos vendedores é: {value}')

A quantidade de cidades únicas dos vendedores é: 611

### Qual o número total de pedidos únicos acima de R$ 3.500

In [12]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.order_id)
  FROM
    order_items oi
  WHERE
    oi.price > 3500
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'Total de pedidos únicos acima de R$ 3.500,00 é: {value}')

Total de pedidos únicos acima de R$ 3.500,00 é: 18

### Qual o valor médio do preço de todos os pedidos?

In [13]:
cursor.execute(
  """
  SELECT
    AVG(oi.price)
  FROM
    order_items oi
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'O valor médio é: {value}')

O valor médio é: 120.65

### Qual o menor e o maior valor de preço entre todos os pedidos?

In [14]:
min_value = cursor.execute(
  """
  SELECT
    MIN(oi.price)
  FROM
    order_items oi
  """
)

rows = min_value.fetchall()
value = rows[0][0]
print(f'O menor preço é: {value}')

max_value = cursor.execute(
  """
  SELECT
    MAX(oi.price)
  FROM
    order_items oi
  """
)

rows = max_value.fetchall()
value = rows[0][0]
print(f'O menor preço é: {value}')

O menor preço é: 0.85
O menor preço é: 6735.0

### Qual a quantidade de produtos distintos vendidos abaixo do preço de R$ 100.00?

In [15]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.product_id)
  FROM
    order_items oi
  WHERE oi.price < 100
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'Quantidade de produtos distintos abaixo dos R$ 100,00: {value}')

Quantidade de produtos distintos abaixo dos R$ 100,00: 20112

### Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016?

In [16]:
cursor.execute(
  """
  SELECT
    COUNT(DISTINCT oi.seller_id)
  FROM
    order_items oi
  WHERE oi.shipping_limit_date < "2016-09-23"
  """
)

rows = cursor.fetchall()

value = rows[0][0]

print(f'{value} vendedores')

2 vendedores

### Quais os tipos de pagamentos existentes?

In [17]:
cursor.execute(
    """
    SELECT DISTINCT
      op.payment_type
    FROM
      order_payments op
    """
)

rows = cursor.fetchall()

rows_list = [row[0] for row in rows]

print(', '.join(rows_list))

credit_card, boleto, voucher, debit_card, not_defined

### Qual o maior e o menor número de parcelas realizado?

In [18]:
max_installments = cursor.execute(
  """
  SELECT
    MAX(op.payment_installments)
  FROM
    order_payments op
  """
)

rows = max_installments.fetchall()
value = rows[0][0]
print(f'{value} é a maior da quantidade de parcela')

min_installments = cursor.execute(
  """
  SELECT
    MIN(op.payment_installments)
  FROM
    order_payments op
  """
)

rows = min_installments.fetchall()
value = rows[0][0]
print(f'{value} é a menor da quantidade de parcela')

24 é a maior da quantidade de parcela
0 é a menor da quantidade de parcela

### Qual a média do valor pago no cartão de crédito?

In [19]:
cursor.execute(
  """
  SELECT
    AVG(op.payment_value)
  FROM
    order_payments op
  WHERE
    op.payment_type = "credit_card"
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'O valor médio é pago no cartão de crédito é de R$ {value}')

O valor médio é pago no cartão de crédito é de R$ 163.32

###  Quantos tipos de status para um pedido existem?

In [20]:
count_status = cursor.execute(
  """
  SELECT
    COUNT(DISTINCT o.order_status)
  FROM
    orders o
  """
)

rows = count_status.fetchall()
count_status = round(rows[0][0], 2)

name_status = cursor.execute(
  """
  SELECT DISTINCT
    o.order_status
  FROM
    orders o  
  """
)

rows = name_status.fetchall()
rows_list = [row[0] for row in rows]

print(f'Existem {count_status} status')
print(f'São eles: ' + ', '.join(rows_list))

Existem 8 status
São eles: delivered, invoiced, shipped, processing, unavailable, canceled, created, approved

  ### Quantos clientes distintos fizeram um pedido?

In [21]:
cursor.execute(
  """
  SELECT DISTINCT
    COUNT(DISTINCT o.customer_id)
  FROM
    orders o
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value} Clientes')

99441 Clientes

### Quantos produtos estão cadastrados na empresa?

In [22]:
cursor.execute(
  """
  SELECT DISTINCT
    COUNT(DISTINCT p.product_id)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value} Produtos cadastrados')

32951 Produtos cadastrados

### Qual a quantidade máxima de fotos de um produto?

In [23]:
cursor.execute(
  """
  SELECT DISTINCT
    MAX(p.product_photos_qty)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0])

print(f'{value} fotos')

20 fotos

### Qual o maior valor do peso entre todos os produtos?

In [24]:
cursor.execute(
  """
  SELECT DISTINCT
    MAX(p.product_weight_g)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0])

print(f'{value}g')

40425g

### Qual a altura média dos produtos?

In [25]:
cursor.execute(
  """
  SELECT
    AVG(DISTINCT p.product_height_cm)
  FROM
    products p
  """
)

rows = cursor.fetchall()

value = round(rows[0][0], 2)

print(f'{value}cm')

52.67cm

## Ciclo_03

### Qual o número de clientes únicos de todos os estados?

In [36]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    COUNT(DISTINCT c.customer_id) AS numero_clientes
  FROM
    customer c
  GROUP BY
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_clientes"])

display(df)

   estado  qnt_clientes
0      AC            81
1      AL           413
2      AM           148
3      AP            68
4      BA          3380
5      CE          1336
6      DF          2140
7      ES          2033
8      GO          2020
9      MA           747
10     MG         11635
11     MS           715
12     MT           907
13     PA           975
14     PB           536
15     PE          1652
16     PI           495
17     PR          5045
18     RJ         12852
19     RN           485
20     RO           253
21     RR            46
22     RS          5466
23     SC          3637
24     SE           350
25     SP         41746
26     TO           280

### Qual o número de cidades únicas de todos os estados?

In [39]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    COUNT(DISTINCT c.customer_city) AS qnt_cidades
  FROM
    customer c
  GROUP BY
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "qnt_cidades"])

display(df)

   estado  qnt_cidades
0      AC            8
1      AL           68
2      AM            5
3      AP            6
4      BA          353
5      CE          161
6      DF            6
7      ES           95
8      GO          178
9      MA          122
10     MG          745
11     MS           67
12     MT          101
13     PA           89
14     PB           92
15     PE          152
16     PI           72
17     PR          364
18     RJ          149
19     RN           90
20     RO           35
21     RR            2
22     RS          379
23     SC          240
24     SE           46
25     SP          629
26     TO           56

### Qual o número de clientes únicos por estado e por cidade?

In [44]:
cursor.execute(
  """
  SELECT
    c.customer_state,
    c.customer_city,
    COUNT(DISTINCT c.customer_id) AS qnt_clientes
  FROM
    customer c
  GROUP BY
    c.customer_state,
    c.customer_city
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["estado", "cidade", "qnt_clientes"])

display(df)

     estado                   cidade  qnt_clientes
0        AC                brasileia             1
1        AC          cruzeiro do sul             3
2        AC           epitaciolandia             1
3        AC            manoel urbano             1
4        AC               porto acre             1
...     ...                      ...           ...
4305     TO             silvanopolis             1
4306     TO  sitio novo do tocantins             2
4307     TO               taguatinga             3
4308     TO           tocantinopolis             7
4309     TO                  xambioa             3

[4310 rows x 3 columns]

### Qual o número de clientes únicos por cidade e por estado?

In [47]:
cursor.execute(
  """
  SELECT
    c.customer_city,
    c.customer_state,
    COUNT(DISTINCT c.customer_id) AS qnt_clientes
  FROM
    customer c
  GROUP BY
    c.customer_city,
    c.customer_state
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["cidade", "estado", "qnt_clientes"])

display(df)

                   cidade estado  qnt_clientes
0     abadia dos dourados     MG             3
1               abadiania     GO             1
2                  abaete     MG            12
3              abaetetuba     PA            11
4                 abaiara     CE             2
...                   ...    ...           ...
4305             xinguara     PA             9
4306          xique-xique     BA             3
4307             zacarias     SP             2
4308              ze doca     MA             5
4309               zortea     SC             2

[4310 rows x 3 columns]

### Qual o número total de pedidos únicos acima de R$ 3.500 por cada vendedor?

In [48]:
cursor.execute(
  """
  SELECT
    oi.seller_id,
    COUNT(DISTINCT oi.order_id) AS qnt_pedidos
  FROM
    order_items oi
  WHERE
    oi.price > 3500
  GROUP BY
    oi.seller_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["vendedor", "qnt_pedidos"])

display(df)

                            vendedor  qnt_pedidos
0   039e6ad9dae79614493083e241147386            1
1   2bf6a2c1e71bbd29a4ad64e6d3c3629f            1
2   403aa86912527d730337ffcb0fb096ab            1
3   512d298ac2a96d1931b6bd30aa21f61d            1
4   585175ec331ea177fa47199e39a6170a            1
5   59417c56835dd8e2e72f91f809cd4092            3
6   80ceebb4ee9b31afb6c6a916a574a1e2            1
7   821fb029fc6e495ca4f08a35d51e53a5            2
8   abe021b01ba992245271b9aa422032df            1
9   c510bc1718f0f2961eaa42a23330681a            1
10  c72de06d72748d1a0dfb2125be43ba63            1
11  e3b4998c7a498169dc7bce44e6bb6277            1
12  ed4acab38528488b65a9a9c603ff024a            1
13  ee27a8f15b1dded4d213a468ba4eb391            1
14  fa1c13f2614d7b5c4749cbc52fecda94            1

### Qual o número total de pedidos únicos, a data mínima e máxima de envio, o valor máximo, mínimo e médio do frete dos pedidos acima de R$ 1.100 por cada vendedor?

In [54]:
cursor.execute(
  """
  SELECT
    oi.seller_id,
    COUNT(DISTINCT oi.order_id) AS qnt_pedidos,
    MIN(oi.shipping_limit_date) AS dt_min_envio,
    MAX(oi.shipping_limit_date) AS dt_max_envio,
    MIN(oi.freight_value) AS val_min_frete,
    MAX(oi.freight_value) AS val_max_frete,
    AVG(oi.freight_value) AS md_frete
  FROM
    order_items oi
  WHERE
    oi.price > 1100
  GROUP BY
    oi.seller_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["vendedor", "qnt_pedidos", "dt_min_envio", "dt_max_envio", "val_min_frete", "val_max_frete", "md_frete"])

display(df)

,vendedor,qnt_pedidos,dt_min_envio,dt_max_envio,val_min_frete,val_max_frete,md_frete
0,014c0679dd340a0e338872e7ec85666a,1,2018-02-08 13:49:36,2018-02-08 13:49:36,49.63,49.63,49.630000
1,02d35243ea2e497335cd0f076b45675d,1,2017-12-22 12:19:24,2017-12-22 12:19:24,97.32,97.32,97.320000
2,0307f7565ff85b299b6e5ef162b1b1a9,1,2017-03-06 12:05:26,2017-03-06 12:05:26,59.73,59.73,59.730000
3,039e6ad9dae79614493083e241147386,5,2018-04-09 11:49:03,2018-08-06 21:06:10,49.55,104.72,69.684000
4,04308b1ee57b6625f47df1d56f00eedf,13,2017-11-21 02:35:37,2018-07-24 21:50:27,24.55,70.29,39.393077
...,...,...,...,...,...,...,...
175,f9244d45189d3a3605499abddeade7d5,3,2017-04-14 07:54:19,2018-08-13 20:55:31,45.74,83.13,67.740000
176,fa1c13f2614d7b5c4749cbc52fecda94,10,2017-02-04 17:01:46,2018-05-10 16:13:33,15.96,27.75,20.512000
177,fbc14c0cf93505ef89f64665ffa4a7b5,4,2017-10-10 13:28:18,2018-08-08 19:35:19,25.64,70.70,42.885000
178,ff063b022a9a0aab91bad2c9088760b7,1,2018-08-22 16:30:44,2018-08-22 16:30:44,42.67,42.67,42.670000
179,ff69aa92bb6b1bf9b8b7a51c2ed9cf8b,6,2018-01-29 22:53:23,2018-06-14 16:19:31,37.26,254.55,128.230000

### Qual o valor médio, máximo e mínimo do preço de todos os pedidos de cada produto?

In [ ]:
cursor.execute(
  """
SELECT
  oi.product_id,
  MIN(oi.price) AS val_min,
  MAX(oi.price) AS val_max,
  AVG(oi.price) AS val_med
FROM
  order_items oi
GROUP BY
  oi.product_id
  """
)

rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["produto", "val_min", "val_max", "val_med"])

display(df)